albizon/ER4_Accordeur/projet/TP-info2/userHardware/include/samd21/samd21Gpio_define.h
/*
* Accordeur de Guitare
* Authors : METAYER Simon & BIZON Alexis
* Created Date : 03/02/17
* Version : 2.0
*/


#ifndef SAMD21GPIO_DEFINE_H_
#define SAMD21GPIO_DEFINE_H_

//nom du port
#define PORTA 0
#define PORTB 1

//mode
#define DISABLE        0
#define OUTPUT         1
#define INPUT          2
#define INPUT_PULLUP   3
#define INPUT_PULLDOWN 4

#define CONFIG_A 0
#define CONFIG_B 1
#define CONFIG_C 2
#define CONFIG_D 3
#define CONFIG_E 4
#define CONFIG_F 5
#define CONFIG_G 6
#define CONFIG_H 7

////////////////////////////////PORTA//////////////


#define PA0 {PORTA; 0}
#define PA1 {PORTA; 1}
#define PA2 {PORTA; 2}
#define PA3 {PORTA; 3}
#define PA4 {PORTA; 4}
#define PA5 {PORTA; 5}
#define PA6 {PORTA; 6}
#define PA7 {PORTA; 7}
#define PA8 {PORTA; 8}
#define PA9 {PORTA; 9}
#define PA10 {PORTA; 10}
#define PA11 {PORTA; 11}
#define PA12 {PORTA; 12}
#define PA13 {PORTA; 13}
#define PA14 {PORTA; 14}
#define PA15 {PORTA; 15}
#define PA16 {PORTA; 16}
#define PA17 {PORTA; 17}
#define PA18 {PORTA; 18}
#define PA19 {PORTA; 19}
#define PA20 {PORTA; 20}
#define PA21 {PORTA; 21}
#define PA22 {PORTA; 22}
#define PA23 {PORTA; 23}
#define PA24 {PORTA; 24}
#define PA25 {PORTA; 25}
#define PA26 {PORTA; 26}
#define PA27 {PORTA; 27}
#define PA28 {PORTA; 28}
#define PA29 {PORTA; 29}
#define PA30 {PORTA; 30}
#define PA31 {PORTA; 31}

///////////////////////////////////PORTB//////////////

#define PB0 {PORTB; 0}
#define PB1 {PORTB; 1}
#define PB2 {PORTB; 2}
#define PB3 {PORTB; 3}
#define PB4 {PORTB; 4}
#define PB5 {PORTB; 5}
#define PB6 {PORTB; 6}
#define PB7 {PORTB; 7}
#define PB8 {PORTB; 8}
#define PB9 {PORTB; 9}
#define PB10 {PORTB; 10}
#define PB11 {PORTB; 11}
#define PB12 {PORTB; 12}
#define PB13 {PORTB; 13}
#define PB14 {PORTB; 14}
#define PB15 {PORTB; 15}
#define PB16 {PORTB; 16}
#define PB17 {PORTB; 17}
#define PB18 {PORTB; 18}
#define PB19 {PORTB; 19}
#define PB20 {PORTB; 20}
#define PB21 {PORTB; 21}
#define PB22 {PORTB; 22}
#define PB23 {PORTB; 23}
#define PB24 {PORTB; 24}
#define PB25 {PORTB; 25}
#define PB26 {PORTB; 26}
#define PB27 {PORTB; 27}
#define PB28 {PORTB; 28}
#define PB29 {PORTB; 29}
#define PB30 {PORTB; 30}
#define PB31 {PORTB; 31}

#endif